export const packages = [
  {
    name: "বেসিক প্যাকেজ",
    price: "৩০ টাকা",
    value: 30,
    features: [
      "৩৬ পয়েন্ট",
      "সর্বোচ্চ ১ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ০ বার অভিভাবকের তথ্য",
    ],
  },
  {
    name: "স্ট্যান্ডার্ড প্যাকেজ",
    price: "১০০ টাকা",
    value: 100,
    features: [
      "১২৫ পয়েন্ট",
      "সর্বোচ্চ ৩ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ১ বার অভিভাবকের তথ্য",
    ],
  },
  {
    name: "প্রিমিয়াম প্যাকেজ",
    price: "২০০ টাকা",
    value: 200,
    features: [
      "২৪০ পয়েন্ট",
      "সর্বোচ্চ ৭ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ৩ বার অভিভাবকের তথ্য",
    ],
  },
  {
    name: "প্রো প্যাকেজ",
    price: "৩০০ টাকা",
    value: 300,
    features: [
      "৩৬০ পয়েন্ট",
      "সর্বোচ্চ ১১ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ৪ বার অভিভাবকের তথ্য",
    ],
  },
  {
    name: "এন্টারপ্রাইজ প্যাকেজ",
    price: "৫০০ টাকা",
    value: 500,
    features: [
      "৬০০ পয়েন্ট",
      "সর্বোচ্চ ১৮ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ৮ বার অভিভাবকের তথ্য",
    ],
  },
  {
    name: "এন্টারপ্রাইজ প্রো প্যাকেজ",
    price: "1000 টাকা",
    value: 1000,
    features: [
      "১২০০ পয়েন্ট",
      "সর্বোচ্চ ৩৬ বার বায়োডাটা শেয়ার",
      "সর্বোচ্চ ১৫ বার অভিভাবকের তথ্য",
    ],
  },
];
