import { useState } from 'react';
import { Colors } from '../../constants/colors';
const Faq = () => {
  // Initialize state to keep track of the open/closed status of each FAQ item
  const [faqItems, setFaqItems] = useState([
    {
      question: 'বিয়ে এর বিশেষত্ব কি?',
      answer:
        'হাই প্রোফাইল/বায়োডাটার ক্ষেত্রে অনেক বেশী রিকুয়েস্ট পেলে রিজেকশনের প্রবণতা তৈরী হতে পারে! বায়োডাটা দাতা হয়তও এভাবে ভাবেন না যে অপরদিক থেকে প্রত্যেকে টাকা পে করে! বিয়ে চায় বায়ো-ক্রেতাদের লসকে মিনিমাইজ করার লক্ষে ২টি ধাপ ইন্ট্রোডিউস করেছে!',
    },
    {
      question: 'অনুরোধ পাঠান কি?',
      answer:
        'অনুরোধ পাঠানোতে বায়ো-ক্রেতা ৩০% পেমেন্ট করে (৩০ পয়েন্ট)  নিজের বায়োডাটা তার ক্রয়কৃত বায়োডাটার ব্যক্তির সাথে শেয়ার করতে পারবে।  তারপর অ্যাপ্রুভাল পেলেই কেবল সামনে আগাতে পারবে। এ পদ্ধতিতে বায়ো ক্রেতাকে পুরো টাকা পে করতে হচ্ছে না। ',
    },
    {
      question: 'যোগাযোগ তথ্য অনুরোধ কি?',
      answer:
        'এটি বায়োডাটা ক্রয়ের চূড়ান্ত ধাপ। অনুরোধ পাঠানোতে শেয়ার করা বায়োডাটাসহ তথ্যের ভিত্তিতে  অ্যাপ্রুভাল পেলেই শুধুমাত্র যোগাযোগ তথ্য অনুরোধের জন্য  ৭০ পয়েন্ট খরচ করে ফাইনালি অভিভাবকের তথ্য পেতে পারবে। ',
    },
    {
      question: 'পয়েন্ট এর রেট কত?',
      answer:
        'বর্তমান রেট অনুযায়ী ১ টাকা = ১.২ পয়েন্ট।  তবে বিয়ে কর্তৃপক্ষ যেকোনোসময় এই রেট পরিবর্তন করতে পারে!',
    },
    {
      question:
        'আমি কি আমার একাউন্ট দিয়ে আমার ছেলে/মেয়ে/আত্মীয়দের জন্য বায়োডাটা  তৈরি করতে পারবো?',
      answer:
        'হ্যাঁ, আপনি অভিভাবক হিসেবে রেজি করে আপনার অধিনস্থ/নিকটাত্মীয়দের জন্য বায়োডাটা পাবলিশ করতে পারবেন ইনশাআল্লহ',
    },
    {
      question: 'অভিভাবকের অনুমতি ছাড়া কি আমি বায়োডাটা দিতে পারবো? ',
      answer:
        'না! অভিভাবকের পারমিশন ছাড়া আপনার বায়োডাটা অ্যাপ্রুভ করা হবে না। বিয়ে আপনার প্রদত্ত অভিভাবকের তথ্য অনুযায়ী তাদের সম্মতি সাপেক্ষে  বায়োডাটার অ্যাপ্রুভাল দিবে। ভুল তথ্য দিয়ে প্রতারণা করলে বায়োডাটাসহ একাউন্ট ব্যান করে দেওয়া হবে।',
    },
    {
      question:
        'আমি কি নগদ/রকেট/ব্যাংকিং মেথড দিয়ে পেমেন্ট করে বায়োডাটা কিনতে পারবো?',
      answer: 'না। আপাতত আমরা শুধুমাত্র বিকাশ পেমেন্ট গ্রহণ করে থাকি।',
    },
    {
      question: 'অনুরোধ পাঠানোতে রিজেকশন পেলে করনীয় কি? ',
      answer:
        'এটা পুরোটাই বায়োডাটা দাতার উপর নির্ভর করে। রিজেকশনের পর আর ঐ বায়োডাটার তথ্য দেখা তর সম্ভব না।',
    },
    {
      question: 'অনুরোধ পাঠানোর প্রশ্নগুলো কিসের এবং কেন?',
      answer:
        'প্রশ্নগুলো বিয়ে কর্তৃপক্ষ নির্ধারিত! এগুলোর ভিত্তিতে বায়োডাটা-দাতা বায়ো-ক্রেতার ইসলামিক মাইন্ডসেট ও তাকওয়ার কিছুটা ধারণা পেতে পারে। এগুলো বায়োডাটা-দাতা কর্তৃক সেট করার বিষয়ে শীঘ্রই কাজ করা হবে। তখন সর্বোচ্চ ১০টি প্রশ্ন বায়োডাটা সেট করে দিতে পারবে যা প্রত্যেক বায়ো-ক্রেতাকে উত্তর দিতে হবে',
    },
    {
      question: 'অনুরোধ পাঠানোতে অ্যাপ্রুভাল পেয়েছি, এখন করনীয় কি? ',
      answer:
        "যে বায়োডাটায় অনুরোধ পাঠানোতে অ্যাপ্রুভাল পেয়েছেন,ওই বায়োডাটার ডিটেইলসে গিয়ে একেবারে শেষের(নিচে) দিকে যোগাযোগ তথ্য অনুরোধের জন্য পেমেন্ট করার লিংক পাবেন। অথবা, আপনার ড্যাশবোর্ডের বাম পাশের সাইডবারেও 'আমার ক্রয়সমুহ' সেকশনে/পেইজে গিয়ে আপনার সকল ক্রয়(অনুরোধ পাঠান ও যোগাযোগ তথ্য অনুরোধ) দেখতে পারবেন। আপনার একাউন্টে পর্যাপ্ত পয়েন্টস থাকলে ডিরেক্ট পয়েন্ট খরচ করে যোগাযোগ তথ্য অনুরোধ কম্প্লিট করতে পারবেন। আর পর্যাপ্ত পয়েন্ট না থাকলে, প্রয়োজনীয় (ঘাটতি) পয়েন্টের জন্য পেমেন্ট করে যোগাযোগ তথ্য অনুরোধ সম্পন্ন করতে পারবেন।",
    },
    {
      question: 'কিভাবে অভিভাবকের তথ্য দেখতে পারবো? ',
      answer:
        "যোগাযোগ তথ্য অনুরোধের পেমেন্ট করার সাথে সাথেই অভিভাবকের তথ্য দেখতে পারবেন। এক্ষেত্রে বায়োডাটার ডিটেইলস পেইজের একেবারে শেষের দিকে অভিভাবকের তথ্য দেখতে পারবেন। পাশাপাশি, আপনার ড্যাশবোর্ড থেকেও 'আমার ক্রয়সমুহ' পেইজ থেকে যোগাযোগ তথ্য অনুরোধ সেকশন থেকে সকল তথ্য দেখতে পারবেন ইনশাআল্লহ",
    },
    {
      question:
        'অনুরোধ পাঠানোতে অ্যাপ্রুভাল/রিজেকশনের বিষয়ে কখন জানতে পারবো? ',
      answer:
        'এটি নির্ভর করে বায়োডাটা-দাতা কখন অ্যাপ্রুভ/রিজেক্ট করে। অ্যাপ্রুভ/রিজেক্ট করামাত্রই আপনাকে মেইল করে জানিয়ে দেওয়া হবে।কখনও এসএমএসও পেতে পারেন।',
    },
    {
      question: 'কোনো বায়োডাটার অ্যাপ্রুভাল রেট কিংবা রিজেকশন রেট কি?',
      answer:
        'এটি হলো বায়োডাটা-দাতা কতগুলো অনুরোধে অ্যাপ্রুভ কিংবা রিজেক্ট করেছেন এবং সর্বমোট কতগুলো বায়োডাটা রিকুয়েস্ট পেয়েছেন,  তার শতকরা অনুপাত।<br>অ্যাপ্রুভাল রেট = (অনুরোধে অ্যাপ্রুভাল সংখ্যা/মোট পাওয়া রিকুয়েস্ট সংখ্যা)*১০০ %;<br>রিজেকশন রেট = (অনুরোধে রিজেকশন সংখ্যা/মোট পাওয়া রিকুয়েস্ট সংখ্যা)*১০০ %',
    },
    {
      question: 'বায়োডাটার রিজেকশন রেট বেশি। এর অর্থ কি?',
      answer:
        'এই বায়োডাটা-দাতার রিজেক্ট করার প্রবণতা বেশি হতে পারে। এটা দেখে কতগুলো রিজেক্ট করেছে তা নির্নয় করে আপনি সিদ্ধান্ত নিতে পারেন যে এখানে বায়ো রিকুয়েস্ট করবেন কিনা। ইউজারকে সতর্ক করতেই এই ফিচার। তবে, কারো রিজেশন রেট বেশি থাকা মানেই সে আপনার বায়োডাটাও রিজেক্ট করতে পারে, বিষয়টি এমন নয়। হতে পারে, যাদেরকে রিজেক্ট করছে, তাদের সাথে তার সমতা হয়নি কিংবা চাওয়া-পাওয়ায় মিল হয়নি।',
    },
    {
      question: 'ফিচার্ড বায়োডাটা কি? ',
      answer:
        "এটা মুলত বিজ্ঞাপনের মতো। আপনার বায়োডাটা ফিচার করতে ১৫০ পয়েন্ট  (১০০/১.২)= ১২৫ টাকা পেমেন্ট করতে হবে। এতে আপনার বায়োডাটা বিয়ে ওয়েবসাইটের হোমপেইজের 'ফিচার্ড' সেকশনে থাকবে এবং বেশি ভিজিটর/ভিউ পেতে পারেন। পাশাপাশি, ফিচার্ড বায়োডাটা বিয়ে এর ফেসবুক পেইজে পোষ্ট করা হয়।",
    },
    {
      question: 'আমার বিয়ের কথাবার্তা চলছে! আমার কি কোনো করণীয় আছে? ',
      answer:
        "এই ক্ষেত্রে 'বিয়ে' জোরালোভাবে সাজেস্ট করে বায়েডাটা 'হাইড' করতে। হাইড না করলে এঅবস্থায় কেউ টাকা খরচ করে আপনার বায়োডাটা ক্রয় করুক, বিয়ে এটা কখনওই সমর্থন করে না এবং চায় না।",
    },
    {
      question: 'আমার বায়োডাটা কিভাবে হাইড করবো?',
      answer:
        "আপনি সাময়িকভাবে কোনো বায়ো-রিকুয়েস্ট না পেতে চাইলে আপনার বায়োডাটা আপনার ড্যাশবোর্ড থেকে 'সেটিংস' পেইজে গিয়ে হাইড/শো করাতে পারবেন। ",
    },
    {
      question: 'আমার বিয়ে হয়ে গেছে। এখন করণীয় কি?',
      answer:
        'আপনাকে অবশ্যই বায়োডাটা হাইড করতে হবে। অন্যথায়, আপনার বায়োডাটা কেউ কিনলে সে দায়ভার বিয়ে কখনওই নিবে না। বিয়ে হয়ে যাওয়ার পরও বায়োডাটা পাবলিশড রাখলে তা হবে অনৈতিক। ',
    },
    {
      question:
        '১৮ বছরের কম বয়সী মেয়ে কিংবা ২১ বছরের কম বয়সী ছেলেদের বায়োডাটা কি অ্যাপ্রুভ করা হয়? ',
      answer:
        'ইসলাম অবশ্যই ১৮ বছরের কম বয়সী মেয়ে কিংবা ২১ বছরের কম বয়সী ছেলেদের বিয়ে সমর্থন করে। এটা অস্বীকার করা কিংবা তুচ্ছতাচ্ছিল্য করা কুফুরির পর্যায়ের মধ্যে পড়তে পারে। কিন্তু আইনি ঝামেলা এড়াতে ১৮ বছরের কম মেয়ে এবং ২১ বছরের কম ছেলেদের বায়ো অ্যাপ্রুভ করা হয় না।',
    },
    {
      question: 'বায়োডাটা অ্যাপ্রুভ/রিজেক্ট কখন হবে এবং কিভাবে বুঝবো?',
      answer:
        '৩-৭ কার্যদিবসের মধ্যে ইনশাআল্লহ অ্যাপ্রুভ/রিজেক্ট হবে। আপনাকে মেইল করে জানিয়ে দেওয়া হবে। ',
    },

    // Add more FAQ items as needed
  ]);

  // Function to toggle the open/closed state of an FAQ item
  const toggleItem = (index) => {
    console.log('index~~', index);
    const updatedFaqItems = [...faqItems];
    updatedFaqItems[index].isOpen = !updatedFaqItems[index].isOpen;
    setFaqItems(updatedFaqItems);
  };

  return (
    <div className="max-w-2xl mx-auto mt-8 mb-8">
      <h1
        className="text-xl md:text-2xl lg:text-3xl font-semibold mb-4"
        style={{ color: Colors.titleText }}
      >
        Frequently Asked Questions
      </h1>
      <ul>
        {faqItems.map((item, index) => (
          <li
            key={index}
            role="button"
            tabIndex={0}
            onClick={() => toggleItem(index)}
            onKeyDown={(e) => {
              if (e.key === 'Enter' || e.key === ' ') {
                e.preventDefault();
                toggleItem(index);
              }
            }}
            className="border-b py-4 bg-gray-300 px-8  mb-4 rounded cursor-pointer"
            style={{ borderBottomColor: `rgba(${Colors.titleText}, 0.7)` }}
          >
            <div className="flex justify-between items-center">
              <h2 className="text-lg font-bold">{item.question}</h2>
              <button className="text-gray-900 hover:text-gray-900 cursor-pointer text-xl">
                {item.isOpen ? '-' : '+'}
              </button>
            </div>
            {item.isOpen && <p className="mt-2 text-left">{item.answer}</p>}
          </li>
        ))}
      </ul>
    </div>
  );
};

export default Faq;
